docs/journal/2019-04-15.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-01-19 日 16:28 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="clothoid" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org2deaf5c">1. 2019-04-15</a>
<ul>
<li><a href="#org1623f5f">1.1. 18:54</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org2deaf5c" class="outline-2">
<h2 id="org2deaf5c"><span class="section-number-2">1.</span> 2019-04-15</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org1623f5f" class="outline-3">
<h3 id="org1623f5f"><span class="section-number-3">1.1.</span> 18:54</h3>
<div class="outline-text-3" id="text-1-1">
<p>
時刻が入らない問題は
</p>

<p>
<a href="https://gitmemory.com/mrvdb">mrvdb ( Marcel van der Boom )</a> の以下が起きていることが分かった。
</p>

<pre class="example" id="org770892c">
Messages buffer has: user-error: There was no year zero ( I missed this the first time)
Tried again from scratch, but first issuing org-reload before org-journal-new-entry which made it work.
</pre>

<p>
特に、以下を設定すると怪しいことも分かった。
</p>

<div class="org-src-container">
<pre class="src src-elisp">(setq org-journal-dir "~/Dropbox/journal")
</pre>
</div>

<p>
でも、プログラミングが分からないから、これ以上は分からない。
調べたくない。
つらい。
</p>

<p>
夕方 16:30 ぐらいに疲れて寝てしまった。
つらい。
明日から新しい職場だというのに大丈夫だろうか。
不安だ。
</p>

<p>
午前中はメルカリで売れたキーボードを送るために、ダンボールを無料でくれるところはないかと歩き回ったりした。
最近はどこもくれない。
売っているものだから、というのが理由らしい。
よく分からない。
最後の頼みだったスーパーの超冷たいおばちゃんがくれた。
優しいんだかなんだか。
持ってきたダンボールは超ピッタリサイズで嬉しくなった。
写真撮って相方に送ろうかと思うほどだった。
やめたけど。
</p>

<p>
英語の履歴書というか職務経歴書も書いた。
簡単なもの。
明日からの職場が合わなければ、すぐに出せるようにというところで。
不安だ。
</p>

<p>
xmodmap は古いというのをみて、変えようと少し調べた。
xmodmap の書き方も不明だし。
xkb や xkeysnail というのがあると分かった。
費用対効果を考えて、変えるのはやめた。
動いてるし。
ubuntu では動かないらしい。
明日からの職場の PC ではキーマップを変えられるだろうか。
不安だ。
</p>

<p>
Trello で蔵書管理するというアイディアを実践しようとした。
かなりいいアイディアだと思うのだが、リスト名を何にして、いくつつくるかという仕様のところで挫折した。
PDF と Kindle と現物もあるし。
ラベルというのを利用したら、ラベルの色名が org-trello でタグとしてインポートされる仕様だと分かった。
そりゃないだろう。
pdf というlabel をつけたところ :sky: とか出てきたし(色が sky だった)。
プログラミングが分からないから、これ以上は調べない。
つらい。
</p>

<p>
そういえば、今日が前職?の正式な退職日だ。
保険証を返却するために郵便局に行った。
封筒付きのものをくれると思ったのだが、それは現金書留だけだということだった。
カード型の超小さい封筒に入れていったので、普通の封筒を買うハメになった。
つらい。
</p>

<p>
郵便局に置いてある糊を使って封をしようとしたら、スポンジみたいになっている塗るところが取れて、中の糊がドバッと出てきて作業台に広がった。
ティシュをもらい、拭いたりした。
つらい。
</p>

<p>
朝、メルカリ用のプチプチを購入するために、ドンキへ行ったのだが、そこで無脂肪牛乳を買うのを忘れた。
Trello で買い物管理しようというところなのに、忘れた。
また夕方行ったりした。
つらい。
</p>

<p>
ヒロシです、みたいな日記になったけど、ギャグではないところが、つらい。
</p>

<p>
これから、シャワーをあびて、夕飯づくり。
鶏のレバーを買ってきたのだが、品質が悪く、肉を掃除していると食えるところ少ないんじゃないかというぐらい小くなってしまったモノがあった。
つらい。
</p>

<p>
海外で病気になったとき医者に症状を伝えるためのサインというのがバズられていた(相方に教わった)。
</p>

<p>
<a href="https://twitter.com/yukio8494/status/1116512094315147264">https://twitter.com/yukio8494/status/1116512094315147264</a>
</p>

<p>
元ネタは Youtube
</p>

<p>
<a href="https://twitter.com/yukio8494/status/1116896483394183169">https://twitter.com/yukio8494/status/1116896483394183169</a>
</p>

<p>
<a href="https://www.youtube.com/watch?v=N_rAmaQXfEA">https://www.youtube.com/watch?v=N_rAmaQXfEA</a>
</p>

<p>
便利そう。
</p>

<p>
Dired でフォルダの総容量が出るのだけど byte 表示でキツかった。
以下で解決した。
</p>

<div class="org-src-container">
<pre class="src src-elisp">(setq dired-listing-switches "-la --si --time-style long-iso")
</pre>
</div>

<p>
以下ではできないとか、できるとか色々書いてあって、つらかった。
</p>

<p>
<a href="https://stackoverflow.com/questions/30865056/emacs-dired-reverse-date-order">https://stackoverflow.com/questions/30865056/emacs-dired-reverse-date-order</a>
</p>

<p>
<a href="https://stackoverflow.com/questions/2858097/customizing-dired">https://stackoverflow.com/questions/2858097/customizing-dired</a>
</p>

<p>
しかし、以下が参考になった。
</p>

<p>
<a href="http://www.wilkesley.org/~ian/xah/emacs/dired_sort.html">http://www.wilkesley.org/~ian/xah/emacs/dired_sort.html</a>
</p>

<p>
よかった。
</p>

<p>
xserver から、更新ボタンを押せという案内が来た。
仕様が変わったらしい。
つらい。
</p>

<ul class="org-ul">
<li>契約更新手続きの義務化について - 2019/01/30 | 無料レンタルサーバー【エックスフリー】
<ul class="org-ul">
<li><a href="https://www.xfree.ne.jp/news_detail.php?view_id=1872">https://www.xfree.ne.jp/news_detail.php?view_id=1872</a></li>
</ul></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: clothoid</p>
<p class="date">Created: 2025-01-19 日 16:28</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
